// Написать функцию, которая принимает массив чисел и возвращает самое большое и самое маленькое число
// Например test4([54, 123, 53, 72, 22, 8, 3, 63, 11, 93, 28]) -> [3, 123]


// Написать функцию, которая принимает объект и возвращает значение у которого больше всего символов
// const obj = {
//         name: 'Peter',
//         country: 'Australia',
//         age: 28,
//         phone: 612629590339,
//         job: 'designer'
// }
// Например test2(obj) -> '612629590339'


// Написать функцию, которая принимает 2 массива и возвращает массив со значениями которые есть в обоих массивах
// Например test2([1, 24, 54, 3, 74, 34, 65], [234, 54, 32, 34, 64]) -> [54, 34]
