// Написать функцию, которая принимает массив, и проверяет что все элементы больше 50
// Например test5([43, 84, 35, 94, 64, 95, 82]) -> false
// Например test5([99, 84, 35, 94, 64, 95, 82]) -> true


// Написать функцию, которая принимает строку, и проверяет является ли эта строка палиндромом
// Например test2('шалаш') -> true
// Например test2('дом') -> false


// Написать функцию, которая принимает массив объектов и строку которая является ключом объекта,
// и возвращает массив значений которые равны ключу
// const data = [
//     {
//         car: 'audi',
//         model: 'A5',
//         power: 330
//     },
//     {
//         car: 'toyota',
//         model: 'rav4',
//         power: 200
//     },
//     {
//         car: 'ford',
//         model: 'mustang',
//         power: 570
//     },
// ]
// Например test1(data, power) -> [330, 200, 570]
// Например test1(data, model) -> ['A5', 'rav4', 'mustang']


// Написать функцию, которая принимает массив объектов, затем если все значения в объектах числа, то возвращаем их сумму, а если строки
// то конкатенируем их с разделителем '-'
// const data1 = [
//     { name: 'Tim' },
//     { name: 'Sam' },
//     { name: 'Jess' },
//     { name: 'Boby' },
// ]
// const data2 = [
//     { age: 19 },
//     { age: 43 },
//     { age: 29 },
//     { age: 21 },
// ]
// Например test1(data1) -> 'Tim-Sam-Jess-Boby'
// Например test1(data2) -> 112
